Revit 2027 API
BuiltInFailures.GroupFailures.CannotCreateGroupWithInvalidReferences Property
 The elements you have selected for grouping contain dimensions or tags which do not reference a common model group. No detail group has been created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateGroupWithInvalidReferences { get; }
Public Shared ReadOnly Property CannotCreateGroupWithInvalidReferences As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateGroupWithInvalidReferences {
	FailureDefinitionId^ get ();
}
static member CannotCreateGroupWithInvalidReferences : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace